MikroElektronika/core_packages/PIC/XC8/def/PIC18F24K42/mcu.h
// Register: DMA1DSAH
#define DMA1DSAH DMA1DSAH
extern volatile unsigned char           DMA1DSAH            __at(0x3BF1);
#ifndef _LIB_BUILD
asm("DMA1DSAH equ 03BF1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSA                    :8;
    };
    struct {
        unsigned DSA8                   :1;
        unsigned DSA9                   :1;
        unsigned DSA10                  :1;
        unsigned DSA11                  :1;
        unsigned DSA12                  :1;
        unsigned DSA13                  :1;
        unsigned DSA14                  :1;
        unsigned DSA15                  :1;
    };
    struct {
        unsigned DMA1DSA                :8;
    };
    struct {
        unsigned DMA1DSA8               :1;
        unsigned DMA1DSA9               :1;
        unsigned DMA1DSA10              :1;
        unsigned DMA1DSA11              :1;
        unsigned DMA1DSA12              :1;
        unsigned DMA1DSA13              :1;
        unsigned DMA1DSA14              :1;
        unsigned DMA1DSA15              :1;
    };
} DMA1DSAHbits_t;
extern volatile DMA1DSAHbits_t DMA1DSAHbits __at(0x3BF1);
// bitfield macros
#define _DMA1DSAH_DSA_POSN                                  0x0
#define _DMA1DSAH_DSA_POSITION                              0x0
#define _DMA1DSAH_DSA_SIZE                                  0x8
#define _DMA1DSAH_DSA_LENGTH                                0x8
#define _DMA1DSAH_DSA_MASK                                  0xFF
#define _DMA1DSAH_DSA8_POSN                                 0x0
#define _DMA1DSAH_DSA8_POSITION                             0x0
#define _DMA1DSAH_DSA8_SIZE                                 0x1
#define _DMA1DSAH_DSA8_LENGTH                               0x1
#define _DMA1DSAH_DSA8_MASK                                 0x1
#define _DMA1DSAH_DSA9_POSN                                 0x1
#define _DMA1DSAH_DSA9_POSITION                             0x1
#define _DMA1DSAH_DSA9_SIZE                                 0x1
#define _DMA1DSAH_DSA9_LENGTH                               0x1
#define _DMA1DSAH_DSA9_MASK                                 0x2
#define _DMA1DSAH_DSA10_POSN                                0x2
#define _DMA1DSAH_DSA10_POSITION                            0x2
#define _DMA1DSAH_DSA10_SIZE                                0x1
#define _DMA1DSAH_DSA10_LENGTH                              0x1
#define _DMA1DSAH_DSA10_MASK                                0x4
#define _DMA1DSAH_DSA11_POSN                                0x3
#define _DMA1DSAH_DSA11_POSITION                            0x3
#define _DMA1DSAH_DSA11_SIZE                                0x1
#define _DMA1DSAH_DSA11_LENGTH                              0x1
#define _DMA1DSAH_DSA11_MASK                                0x8
#define _DMA1DSAH_DSA12_POSN                                0x4
#define _DMA1DSAH_DSA12_POSITION                            0x4
#define _DMA1DSAH_DSA12_SIZE                                0x1
#define _DMA1DSAH_DSA12_LENGTH                              0x1
#define _DMA1DSAH_DSA12_MASK                                0x10
#define _DMA1DSAH_DSA13_POSN                                0x5
#define _DMA1DSAH_DSA13_POSITION                            0x5
#define _DMA1DSAH_DSA13_SIZE                                0x1
#define _DMA1DSAH_DSA13_LENGTH                              0x1
#define _DMA1DSAH_DSA13_MASK                                0x20
#define _DMA1DSAH_DSA14_POSN                                0x6
#define _DMA1DSAH_DSA14_POSITION                            0x6
#define _DMA1DSAH_DSA14_SIZE                                0x1
#define _DMA1DSAH_DSA14_LENGTH                              0x1
#define _DMA1DSAH_DSA14_MASK                                0x40
#define _DMA1DSAH_DSA15_POSN                                0x7
#define _DMA1DSAH_DSA15_POSITION                            0x7
#define _DMA1DSAH_DSA15_SIZE                                0x1
#define _DMA1DSAH_DSA15_LENGTH                              0x1
#define _DMA1DSAH_DSA15_MASK                                0x80
#define _DMA1DSAH_DMA1DSA_POSN                              0x0
#define _DMA1DSAH_DMA1DSA_POSITION                          0x0
#define _DMA1DSAH_DMA1DSA_SIZE                              0x8
#define _DMA1DSAH_DMA1DSA_LENGTH                            0x8
#define _DMA1DSAH_DMA1DSA_MASK                              0xFF
#define _DMA1DSAH_DMA1DSA8_POSN                             0x0
#define _DMA1DSAH_DMA1DSA8_POSITION                         0x0
#define _DMA1DSAH_DMA1DSA8_SIZE                             0x1
#define _DMA1DSAH_DMA1DSA8_LENGTH                           0x1
#define _DMA1DSAH_DMA1DSA8_MASK                             0x1
#define _DMA1DSAH_DMA1DSA9_POSN                             0x1
#define _DMA1DSAH_DMA1DSA9_POSITION                         0x1
#define _DMA1DSAH_DMA1DSA9_SIZE                             0x1
#define _DMA1DSAH_DMA1DSA9_LENGTH                           0x1
#define _DMA1DSAH_DMA1DSA9_MASK                             0x2
#define _DMA1DSAH_DMA1DSA10_POSN                            0x2
#define _DMA1DSAH_DMA1DSA10_POSITION                        0x2
#define _DMA1DSAH_DMA1DSA10_SIZE                            0x1
#define _DMA1DSAH_DMA1DSA10_LENGTH                          0x1
#define _DMA1DSAH_DMA1DSA10_MASK                            0x4
#define _DMA1DSAH_DMA1DSA11_POSN                            0x3
#define _DMA1DSAH_DMA1DSA11_POSITION                        0x3
#define _DMA1DSAH_DMA1DSA11_SIZE                            0x1
#define _DMA1DSAH_DMA1DSA11_LENGTH                          0x1
#define _DMA1DSAH_DMA1DSA11_MASK                            0x8
#define _DMA1DSAH_DMA1DSA12_POSN                            0x4
#define _DMA1DSAH_DMA1DSA12_POSITION                        0x4
#define _DMA1DSAH_DMA1DSA12_SIZE                            0x1
#define _DMA1DSAH_DMA1DSA12_LENGTH                          0x1
#define _DMA1DSAH_DMA1DSA12_MASK                            0x10
#define _DMA1DSAH_DMA1DSA13_POSN                            0x5
#define _DMA1DSAH_DMA1DSA13_POSITION                        0x5
#define _DMA1DSAH_DMA1DSA13_SIZE                            0x1
#define _DMA1DSAH_DMA1DSA13_LENGTH                          0x1
#define _DMA1DSAH_DMA1DSA13_MASK                            0x20
#define _DMA1DSAH_DMA1DSA14_POSN                            0x6
#define _DMA1DSAH_DMA1DSA14_POSITION                        0x6
#define _DMA1DSAH_DMA1DSA14_SIZE                            0x1
#define _DMA1DSAH_DMA1DSA14_LENGTH                          0x1
#define _DMA1DSAH_DMA1DSA14_MASK                            0x40
#define _DMA1DSAH_DMA1DSA15_POSN                            0x7
#define _DMA1DSAH_DMA1DSA15_POSITION                        0x7
#define _DMA1DSAH_DMA1DSA15_SIZE                            0x1
#define _DMA1DSAH_DMA1DSA15_LENGTH                          0x1
#define _DMA1DSAH_DMA1DSA15_MASK                            0x80

// Register: DMA1SCNT
#define DMA1SCNT DMA1SCNT
extern volatile unsigned short          DMA1SCNT            __at(0x3BF2);
#ifndef _LIB_BUILD
asm("DMA1SCNT equ 03BF2h");
#endif

