MikroElektronika/core_packages/PIC/XC8/def/PIC18F24K42/mcu.h
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x1D310);	// @ (0x3A62 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x1D311);	// @ (0x3A62 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x1D312);	// @ (0x3A62 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x1D313);	// @ (0x3A62 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x1D314);	// @ (0x3A62 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x1D315);	// @ (0x3A62 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x1D316);	// @ (0x3A62 * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0x1D317);	// @ (0x3A62 * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// DAC1CON0<OE1>
extern volatile __bit                   OE1                 __at(0x1F4F5);	// @ (0x3E9E * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<OE2>
extern volatile __bit                   OE2                 __at(0x1F4F4);	// @ (0x3E9E * 8 + 4)
#define                                 OE2_bit             _BIT_ACCESS(DAC1CON0,4)
// MD1CON0<OPOL>
extern volatile __bit                   OPOL                __at(0x1E7D4);	// @ (0x3CFA * 8 + 4)
#define                                 OPOL_bit            _BIT_ACCESS(MD1CON0,4)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x1CEDC);	// @ (0x39DB * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// PIE0<OSFIE>
extern volatile __bit                   OSFIE               __at(0x1CC82);	// @ (0x3990 * 8 + 2)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE0,2)
// PIR0<OSFIF>
extern volatile __bit                   OSFIF               __at(0x1CD02);	// @ (0x39A0 * 8 + 2)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR0,2)
// IPR0<OSFIP>
extern volatile __bit                   OSFIP               __at(0x1CC02);	// @ (0x3980 * 8 + 2)
#define                                 OSFIP_bit           _BIT_ACCESS(IPR0,2)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x1FEC3);	// @ (0x3FD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// U1P1H<P1H>
extern volatile __bit                   P1H                 __at(0x1EF68);	// @ (0x3DED * 8 + 0)
#define                                 P1H_bit             _BIT_ACCESS(U1P1H,0)
// U1P2H<P2H>
extern volatile __bit                   P2H                 __at(0x1EF78);	// @ (0x3DEF * 8 + 0)
#define                                 P2H_bit             _BIT_ACCESS(U1P2H,0)
// U1P3H<P3H>
extern volatile __bit                   P3H                 __at(0x1EF88);	// @ (0x3DF1 * 8 + 0)
#define                                 P3H_bit             _BIT_ACCESS(U1P3H,0)
// CCPTMRS1<P5TSEL0>
extern volatile __bit                   P5TSEL0             __at(0x1FAF8);	// @ (0x3F5F * 8 + 0)
#define                                 P5TSEL0_bit         _BIT_ACCESS(CCPTMRS1,0)
// CCPTMRS1<P5TSEL1>
extern volatile __bit                   P5TSEL1             __at(0x1FAF9);	// @ (0x3F5F * 8 + 1)
#define                                 P5TSEL1_bit         _BIT_ACCESS(CCPTMRS1,1)
// CCPTMRS1<P6TSEL0>
extern volatile __bit                   P6TSEL0             __at(0x1FAFA);	// @ (0x3F5F * 8 + 2)
#define                                 P6TSEL0_bit         _BIT_ACCESS(CCPTMRS1,2)
// CCPTMRS1<P6TSEL1>
extern volatile __bit                   P6TSEL1             __at(0x1FAFB);	// @ (0x3F5F * 8 + 3)
#define                                 P6TSEL1_bit         _BIT_ACCESS(CCPTMRS1,3)
// CCPTMRS1<P7TSEL0>
extern volatile __bit                   P7TSEL0             __at(0x1FAFC);	// @ (0x3F5F * 8 + 4)
#define                                 P7TSEL0_bit         _BIT_ACCESS(CCPTMRS1,4)
// CCPTMRS1<P7TSEL1>
extern volatile __bit                   P7TSEL1             __at(0x1FAFD);	// @ (0x3F5F * 8 + 5)
#define                                 P7TSEL1_bit         _BIT_ACCESS(CCPTMRS1,5)
// CCPTMRS1<P8TSEL0>
extern volatile __bit                   P8TSEL0             __at(0x1FAFE);	// @ (0x3F5F * 8 + 6)
#define                                 P8TSEL0_bit         _BIT_ACCESS(CCPTMRS1,6)
// CCPTMRS1<P8TSEL1>
extern volatile __bit                   P8TSEL1             __at(0x1FAFF);	// @ (0x3F5F * 8 + 7)
#define                                 P8TSEL1_bit         _BIT_ACCESS(CCPTMRS1,7)
// I2C1PIE<PC1IE>
extern volatile __bit                   PC1IE               __at(0x1EBD2);	// @ (0x3D7A * 8 + 2)
#define                                 PC1IE_bit           _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PC1IF>
extern volatile __bit                   PC1IF               __at(0x1EBCA);	// @ (0x3D79 * 8 + 2)
#define                                 PC1IF_bit           _BIT_ACCESS(I2C1PIR,2)
// I2C2PIE<PC2IE>
extern volatile __bit                   PC2IE               __at(0x1EB22);	// @ (0x3D64 * 8 + 2)
#define                                 PC2IE_bit           _BIT_ACCESS(I2C2PIE,2)
// I2C2PIR<PC2IF>
extern volatile __bit                   PC2IF               __at(0x1EB1A);	// @ (0x3D63 * 8 + 2)
#define                                 PC2IF_bit           _BIT_ACCESS(I2C2PIR,2)
// ADPCH<PCH3>
extern volatile __bit                   PCH3                __at(0x1F78B);	// @ (0x3EF1 * 8 + 3)
#define                                 PCH3_bit            _BIT_ACCESS(ADPCH,3)
// ADPCH<PCH4>
extern volatile __bit                   PCH4                __at(0x1F78C);	// @ (0x3EF1 * 8 + 4)
#define                                 PCH4_bit            _BIT_ACCESS(ADPCH,4)
// ADPCH<PCH5>
extern volatile __bit                   PCH5                __at(0x1F78D);	// @ (0x3EF1 * 8 + 5)
#define                                 PCH5_bit            _BIT_ACCESS(ADPCH,5)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x1F9F0);	// @ (0x3F3E * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x1CB48);	// @ (0x3969 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x1CB49);	// @ (0x3969 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x1CB4A);	// @ (0x3969 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x1CB4B);	// @ (0x3969 * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x1CEE0);	// @ (0x39DC * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// PCON0<POR>
extern volatile __bit                   POR                 __at(0x1FF81);	// @ (0x3FF0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(PCON0,1)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0x1F7CF);	// @ (0x3EF9 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x1D5F8);	// @ (0x3ABF * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// SMT1PRH<PR10>
extern volatile __bit                   PR10                __at(0x1F8E2);	// @ (0x3F1C * 8 + 2)
#define                                 PR10_bit            _BIT_ACCESS(SMT1PRH,2)
// SMT1PRH<PR11>
extern volatile __bit                   PR11                __at(0x1F8E3);	// @ (0x3F1C * 8 + 3)
#define                                 PR11_bit            _BIT_ACCESS(SMT1PRH,3)
// SMT1PRH<PR12>
extern volatile __bit                   PR12                __at(0x1F8E4);	// @ (0x3F1C * 8 + 4)
#define                                 PR12_bit            _BIT_ACCESS(SMT1PRH,4)
// SMT1PRH<PR13>
extern volatile __bit                   PR13                __at(0x1F8E5);	// @ (0x3F1C * 8 + 5)
#define                                 PR13_bit            _BIT_ACCESS(SMT1PRH,5)
// SMT1PRH<PR14>
extern volatile __bit                   PR14                __at(0x1F8E6);	// @ (0x3F1C * 8 + 6)
#define                                 PR14_bit            _BIT_ACCESS(SMT1PRH,6)
// SMT1PRH<PR15>
extern volatile __bit                   PR15                __at(0x1F8E7);	// @ (0x3F1C * 8 + 7)
#define                                 PR15_bit            _BIT_ACCESS(SMT1PRH,7)
// SMT1PRU<PR16>
extern volatile __bit                   PR16                __at(0x1F8E8);	// @ (0x3F1D * 8 + 0)
#define                                 PR16_bit            _BIT_ACCESS(SMT1PRU,0)
// SMT1PRU<PR17>
extern volatile __bit                   PR17                __at(0x1F8E9);	// @ (0x3F1D * 8 + 1)
#define                                 PR17_bit            _BIT_ACCESS(SMT1PRU,1)
// SMT1PRU<PR18>
extern volatile __bit                   PR18                __at(0x1F8EA);	// @ (0x3F1D * 8 + 2)
#define                                 PR18_bit            _BIT_ACCESS(SMT1PRU,2)
// SMT1PRU<PR19>
extern volatile __bit                   PR19                __at(0x1F8EB);	// @ (0x3F1D * 8 + 3)
#define                                 PR19_bit            _BIT_ACCESS(SMT1PRU,3)
// SMT1PRU<PR20>
extern volatile __bit                   PR20                __at(0x1F8EC);	// @ (0x3F1D * 8 + 4)
#define                                 PR20_bit            _BIT_ACCESS(SMT1PRU,4)
// SMT1PRU<PR21>
extern volatile __bit                   PR21                __at(0x1F8ED);	// @ (0x3F1D * 8 + 5)
#define                                 PR21_bit            _BIT_ACCESS(SMT1PRU,5)
// SMT1PRU<PR22>
extern volatile __bit                   PR22                __at(0x1F8EE);	// @ (0x3F1D * 8 + 6)
#define                                 PR22_bit            _BIT_ACCESS(SMT1PRU,6)
// SMT1PRU<PR23>
extern volatile __bit                   PR23                __at(0x1F8EF);	// @ (0x3F1D * 8 + 7)
#define                                 PR23_bit            _BIT_ACCESS(SMT1PRU,7)
// SMT1PRL<PR7>
extern volatile __bit                   _PR7                 __at(0x1F8DF);	// @ (0x3F1B * 8 + 7)  // Note: Changed by MikroE
#define                                 PR7_bit             _BIT_ACCESS(SMT1PRL,7)
// SMT1PRH<PR8>
extern volatile __bit                   _PR8                 __at(0x1F8E0);	// @ (0x3F1C * 8 + 0)  // Note: Changed by MikroE
#define                                 PR8_bit             _BIT_ACCESS(SMT1PRH,0)
// SMT1PRH<PR9>
extern volatile __bit                   _PR9                 __at(0x1F8E1);	// @ (0x3F1C * 8 + 1)  // Note: Changed by MikroE
#define                                 PR9_bit             _BIT_ACCESS(SMT1PRH,1)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0x1F7B0);	// @ (0x3EF6 * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0x1F7B1);	// @ (0x3EF6 * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0x1F7BA);	// @ (0x3EF7 * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0x1F7BB);	// @ (0x3EF7 * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0x1F7BC);	// @ (0x3EF7 * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0x1F7B2);	// @ (0x3EF6 * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0x1F7B3);	// @ (0x3EF6 * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0x1F7B4);	// @ (0x3EF6 * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0x1F7B5);	// @ (0x3EF6 * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0x1F7B6);	// @ (0x3EF6 * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0x1F7B7);	// @ (0x3EF6 * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0x1F7B8);	// @ (0x3EF7 * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0x1F7B9);	// @ (0x3EF7 * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0x1F7E8);	// @ (0x3EFD * 8 + 0)
#define                                 PREF0_bit           _BIT_ACCESS(ADREF,0)
// ADREF<PREF1>
extern volatile __bit                   PREF1               __at(0x1F7E9);	// @ (0x3EFD * 8 + 1)
#define                                 PREF1_bit           _BIT_ACCESS(ADREF,1)
// ADPREVL<PREV0>
extern volatile __bit                   PREV0               __at(0x1F768);	// @ (0x3EED * 8 + 0)
#define                                 PREV0_bit           _BIT_ACCESS(ADPREVL,0)
// ADPREVL<PREV1>
extern volatile __bit                   PREV1               __at(0x1F769);	// @ (0x3EED * 8 + 1)
#define                                 PREV1_bit           _BIT_ACCESS(ADPREVL,1)
// ADPREVH<PREV10>
extern volatile __bit                   PREV10              __at(0x1F772);	// @ (0x3EEE * 8 + 2)
#define                                 PREV10_bit          _BIT_ACCESS(ADPREVH,2)
// ADPREVH<PREV11>
extern volatile __bit                   PREV11              __at(0x1F773);	// @ (0x3EEE * 8 + 3)
#define                                 PREV11_bit          _BIT_ACCESS(ADPREVH,3)
// ADPREVH<PREV12>
extern volatile __bit                   PREV12              __at(0x1F774);	// @ (0x3EEE * 8 + 4)
#define                                 PREV12_bit          _BIT_ACCESS(ADPREVH,4)
// ADPREVH<PREV13>
extern volatile __bit                   PREV13              __at(0x1F775);	// @ (0x3EEE * 8 + 5)
#define                                 PREV13_bit          _BIT_ACCESS(ADPREVH,5)
// ADPREVH<PREV14>
extern volatile __bit                   PREV14              __at(0x1F776);	// @ (0x3EEE * 8 + 6)
#define                                 PREV14_bit          _BIT_ACCESS(ADPREVH,6)
// ADPREVH<PREV15>
extern volatile __bit                   PREV15              __at(0x1F777);	// @ (0x3EEE * 8 + 7)
#define                                 PREV15_bit          _BIT_ACCESS(ADPREVH,7)
// ADPREVL<PREV2>
extern volatile __bit                   PREV2               __at(0x1F76A);	// @ (0x3EED * 8 + 2)
#define                                 PREV2_bit           _BIT_ACCESS(ADPREVL,2)
// ADPREVL<PREV3>
extern volatile __bit                   PREV3               __at(0x1F76B);	// @ (0x3EED * 8 + 3)
#define                                 PREV3_bit           _BIT_ACCESS(ADPREVL,3)
// ADPREVL<PREV4>
extern volatile __bit                   PREV4               __at(0x1F76C);	// @ (0x3EED * 8 + 4)
#define                                 PREV4_bit           _BIT_ACCESS(ADPREVL,4)
// ADPREVL<PREV5>
extern volatile __bit                   PREV5               __at(0x1F76D);	// @ (0x3EED * 8 + 5)
#define                                 PREV5_bit           _BIT_ACCESS(ADPREVL,5)
// ADPREVL<PREV6>
extern volatile __bit                   PREV6               __at(0x1F76E);	// @ (0x3EED * 8 + 6)
#define                                 PREV6_bit           _BIT_ACCESS(ADPREVL,6)
// ADPREVL<PREV7>
extern volatile __bit                   PREV7               __at(0x1F76F);	// @ (0x3EED * 8 + 7)
#define                                 PREV7_bit           _BIT_ACCESS(ADPREVL,7)
// ADPREVH<PREV8>
extern volatile __bit                   PREV8               __at(0x1F770);	// @ (0x3EEE * 8 + 0)
#define                                 PREV8_bit           _BIT_ACCESS(ADPREVH,0)
// ADPREVH<PREV9>
extern volatile __bit                   PREV9               __at(0x1F771);	// @ (0x3EEE * 8 + 1)
#define                                 PREV9_bit           _BIT_ACCESS(ADPREVH,1)
// PRLOCK<PRLOCKED>
extern volatile __bit                   PRLOCKED            __at(0x1CF78);	// @ (0x39EF * 8 + 0)
#define                                 PRLOCKED_bit        _BIT_ACCESS(PRLOCK,0)
// SMT1CON0<PS0>
extern volatile __bit                   _PS0                 __at(0x1F8F0);	// @ (0x3F1E * 8 + 0)  // Note: Changed by MikroE
#define                                 PS0_bit             _BIT_ACCESS(SMT1CON0,0)
// SMT1CON0<PS1>
extern volatile __bit                   _PS1                 __at(0x1F8F1);	// @ (0x3F1E * 8 + 1)  // Note: Changed by MikroE
#define                                 PS1_bit             _BIT_ACCESS(SMT1CON0,1)
// WDTPSL<PSCNT0>
extern volatile __bit                   PSCNT0              __at(0x1CAE8);	// @ (0x395D * 8 + 0)
#define                                 PSCNT0_bit          _BIT_ACCESS(WDTPSL,0)
// WDTPSL<PSCNT1>
extern volatile __bit                   PSCNT1              __at(0x1CAE9);	// @ (0x395D * 8 + 1)
#define                                 PSCNT1_bit          _BIT_ACCESS(WDTPSL,1)
// WDTPSH<PSCNT10>
extern volatile __bit                   PSCNT10             __at(0x1CAF2);	// @ (0x395E * 8 + 2)
#define                                 PSCNT10_bit         _BIT_ACCESS(WDTPSH,2)
// WDTPSH<PSCNT11>
extern volatile __bit                   PSCNT11             __at(0x1CAF3);	// @ (0x395E * 8 + 3)
#define                                 PSCNT11_bit         _BIT_ACCESS(WDTPSH,3)
// WDTPSH<PSCNT12>
extern volatile __bit                   PSCNT12             __at(0x1CAF4);	// @ (0x395E * 8 + 4)
#define                                 PSCNT12_bit         _BIT_ACCESS(WDTPSH,4)
// WDTPSH<PSCNT13>
extern volatile __bit                   PSCNT13             __at(0x1CAF5);	// @ (0x395E * 8 + 5)
#define                                 PSCNT13_bit         _BIT_ACCESS(WDTPSH,5)
// WDTPSH<PSCNT14>
extern volatile __bit                   PSCNT14             __at(0x1CAF6);	// @ (0x395E * 8 + 6)
#define                                 PSCNT14_bit         _BIT_ACCESS(WDTPSH,6)
// WDTPSH<PSCNT15>
extern volatile __bit                   PSCNT15             __at(0x1CAF7);	// @ (0x395E * 8 + 7)
#define                                 PSCNT15_bit         _BIT_ACCESS(WDTPSH,7)
// WDTTMR<PSCNT16>
extern volatile __bit                   PSCNT16             __at(0x1CAF8);	// @ (0x395F * 8 + 0)
#define                                 PSCNT16_bit         _BIT_ACCESS(WDTTMR,0)
// WDTTMR<PSCNT17>
extern volatile __bit                   PSCNT17             __at(0x1CAF9);	// @ (0x395F * 8 + 1)
#define                                 PSCNT17_bit         _BIT_ACCESS(WDTTMR,1)
// WDTPSL<PSCNT2>
extern volatile __bit                   PSCNT2              __at(0x1CAEA);	// @ (0x395D * 8 + 2)
#define                                 PSCNT2_bit          _BIT_ACCESS(WDTPSL,2)
// WDTPSL<PSCNT3>
extern volatile __bit                   PSCNT3              __at(0x1CAEB);	// @ (0x395D * 8 + 3)
#define                                 PSCNT3_bit          _BIT_ACCESS(WDTPSL,3)
// WDTPSL<PSCNT4>
extern volatile __bit                   PSCNT4              __at(0x1CAEC);	// @ (0x395D * 8 + 4)
#define                                 PSCNT4_bit          _BIT_ACCESS(WDTPSL,4)
// WDTPSL<PSCNT5>
extern volatile __bit                   PSCNT5              __at(0x1CAED);	// @ (0x395D * 8 + 5)
#define                                 PSCNT5_bit          _BIT_ACCESS(WDTPSL,5)
// WDTPSL<PSCNT6>
extern volatile __bit                   PSCNT6              __at(0x1CAEE);	// @ (0x395D * 8 + 6)
#define                                 PSCNT6_bit          _BIT_ACCESS(WDTPSL,6)
// WDTPSL<PSCNT7>
extern volatile __bit                   PSCNT7              __at(0x1CAEF);	// @ (0x395D * 8 + 7)
#define                                 PSCNT7_bit          _BIT_ACCESS(WDTPSL,7)
// WDTPSH<PSCNT8>
extern volatile __bit                   PSCNT8              __at(0x1CAF0);	// @ (0x395E * 8 + 0)
#define                                 PSCNT8_bit          _BIT_ACCESS(WDTPSH,0)
// WDTPSH<PSCNT9>
extern volatile __bit                   PSCNT9              __at(0x1CAF1);	// @ (0x395E * 8 + 1)
#define                                 PSCNT9_bit          _BIT_ACCESS(WDTPSH,1)
// ADCON2<PSIS>
extern volatile __bit                   PSIS                __at(0x1F7D7);	// @ (0x3EFA * 8 + 7)
#define                                 PSIS_bit            _BIT_ACCESS(ADCON2,7)
// DAC1CON0<PSS0>
extern volatile __bit                   PSS0                __at(0x1F4F2);	// @ (0x3E9E * 8 + 2)
#define                                 PSS0_bit            _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<PSS1>
extern volatile __bit                   PSS1                __at(0x1F4F3);	// @ (0x3E9E * 8 + 3)
#define                                 PSS1_bit            _BIT_ACCESS(DAC1CON0,3)
// PWM5DCL<PWM5DC0>
extern volatile __bit                   PWM5DC0             __at(0x1FB66);	// @ (0x3F6C * 8 + 6)
#define                                 PWM5DC0_bit         _BIT_ACCESS(PWM5DCL,6)
// PWM5DCL<PWM5DC1>
extern volatile __bit                   PWM5DC1             __at(0x1FB67);	// @ (0x3F6C * 8 + 7)
#define                                 PWM5DC1_bit         _BIT_ACCESS(PWM5DCL,7)
// PWM5DCH<PWM5DC2>
extern volatile __bit                   PWM5DC2             __at(0x1FB68);	// @ (0x3F6D * 8 + 0)
#define                                 PWM5DC2_bit         _BIT_ACCESS(PWM5DCH,0)
// PWM5DCH<PWM5DC3>
extern volatile __bit                   PWM5DC3             __at(0x1FB69);	// @ (0x3F6D * 8 + 1)
#define                                 PWM5DC3_bit         _BIT_ACCESS(PWM5DCH,1)
// PWM5DCH<PWM5DC4>
extern volatile __bit                   PWM5DC4             __at(0x1FB6A);	// @ (0x3F6D * 8 + 2)
#define                                 PWM5DC4_bit         _BIT_ACCESS(PWM5DCH,2)
// PWM5DCH<PWM5DC5>
